## Plan Result (sbox-managed-identity)




<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.jenkins-mi-policy
  * azurerm_key_vault_access_policy.sops-policy
  * azurerm_key_vault_key.sops-key
  * azurerm_role_assignment.MI-Operator
  * azurerm_role_assignment.Reader
  * azurerm_role_assignment.acme-vault-access
  * azurerm_role_assignment.jenkins-mi-Reader
  * azurerm_role_assignment.log_analytics_role_MI
  * azurerm_role_assignment.log_analytics_role_aks_sp
  * azurerm_role_assignment.network_access
  * azurerm_role_assignment.service_operator[0]
  * azurerm_role_assignment.service_operator_workload_identity[0]
  * azurerm_user_assigned_identity.sops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.jenkins-mi-policy will be created
  + resource "azurerm_key_vault_access_policy" "jenkins-mi-policy" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv"
      + object_id          = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.sops-policy will be created
  + resource "azurerm_key_vault_access_policy" "sops-policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "Encrypt",
          + "Decrypt",
          + "List",
        ]
      + key_vault_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_key.sops-key will be created
  + resource "azurerm_key_vault_key" "sops-key" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv"
      + n                       = (known after apply)
      + name                    = "sops-key"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # azurerm_role_assignment.MI-Operator will be created
  + resource "azurerm_role_assignment" "MI-Operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.acme-vault-access will be created
  + resource "azurerm_role_assignment" "acme-vault-access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.jenkins-mi-Reader will be created
  + resource "azurerm_role_assignment" "jenkins-mi-Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.log_analytics_role_MI will be created
  + resource "azurerm_role_assignment" "log_analytics_role_MI" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.log_analytics_role_aks_sp will be created
  + resource "azurerm_role_assignment" "log_analytics_role_aks_sp" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.network_access will be created
  + resource "azurerm_role_assignment" "network_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.service_operator[0] will be created
  + resource "azurerm_role_assignment" "service_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.service_operator_workload_identity[0] will be created
  + resource "azurerm_role_assignment" "service_operator_workload_identity" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/managed-identities-sandbox-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.sops-mi will be created
  + resource "azurerm_user_assigned_identity" "sops-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + tenant_id           = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":454,"Program":"tfcmt","SHA1":"","Target":"sbox-managed-identity","Vars":{}} -->